# Homework 8
---

## Section 1

SELECT "Accel" 

FROM "evCars";

SELECT "Accel", RTRIM(Accel, ' sec')

FROM "evCars";

UPDATE evCars 

SET Accel = RTRIM(Accel, ' sec')

SELECT Accel
FROM evCars;

ALTER TABLE evCars
 RENAME Accel TO accelSec

## Section 2

SELECT "TopSpeed" 
FROM "evCars";

SELECT "TopSpeed" , RTRIM(TopSpeed, ' km/h')
FROM "evCars";

UPDATE evCars

SET "TopSpeed" = RTRIM(TopSpeed, ' km/h')

SELECT "TopSpeed" , ROUND(TopSpeed	* 0.621371, 1)

FROM "evCars";

UPDATE evCars

SET TopSpeed = TopSpeed	* 0.621371

ALTER TABLE evCars

RENAME TopSpeed TO topSpeedMPH

SELECT *

FROM evCars

## Section 3

SELECT "Range" FROM "evCars";

SELECT "Range", RTRIM(Range, ' km')

FROM "evCars";

UPDATE evCars 
SET Range = RTRIM(Range, ' km')

SELECT "Range" FROM "evCars";

SELECT Range , ROUND(Range	* 0.621371, 1) as RangeMiles

FROM "evCars";

UPDATE evCars

SET Range = Range	* 0.621371

SELECT "Range" FROM "evCars";

ALTER TABLE evCars

RENAME Range TO rangeMiles

SELECT *
FROM evCars

## Section 4

SELECT "Efficiency", "FastCharge" FROM "evCars";

SELECT Efficiency, RTRIM(Efficiency, ' Wh/km'),  FastCharge, rtrim(FastCharge, ' km/h')

FROM "evCars";

UPDATE evCars

SET "Efficiency" = RTRIM(Efficiency, ' Wh/km'),
FastCharge = rtrim(FastCharge, ' km/h')

SELECT * FROM "evCars";

SELECT "FastCharge" , ROUND(FastCharge * 0.621371, 1) as OneHourFastChargeMiles

FROM "evCars";

UPDATE evCars
SET FastCharge = FastCharge	* 0.621371

ALTER TABLE evCars

RENAME FastCharge TO OneHourFastChargeMiles

ALTER TABLE evCars

RENAME Efficiency TO efficiencyWHperKM

SELECT *
FROM evCars

## Section 5

SELECT RapidCharge, Count(*)

FROM evCars

GROUP by RapidCharge

- For the purpose of this exercise, if the car's RapidCharge value equals 'Rapid charging possible', then I want you to change the value to 'Yes'
- If the RapidCharge value equals 'Rapid charging not possible' then I want you to change the value to 'No'.

SELECT  RapidCharge, REPLACE('Rapid charging not possible', 'Rapid charging not possible', 'No')

FROM evCars

SELECT  RapidCharge, REPLACE(RapidCharge, 'Rapid charging possible', 'Yes') as YesString,
FROM evCars

UPDATE evCars

SET RapidCharge = REPLACE(RapidCharge, 'Rapid charging possible', 'Yes')

UPDATE evCars

SET RapidCharge = REPLACE(RapidCharge, 'Rapid charging not possible', 'No')

SELECT "RapidCharge" FROM "evCars";

SELECT RapidCharge, Count(*)
FROM evCars
GROUP by RapidCharge

--ok numbers matching

## Section 6

SELECT PowerTrain, Count(*)

FROM evCars

GROUP by PowerTrain

*Look at the three DISTINCT values from the query you wrote in 6.1 and fill in the blanks.*

- If the PowerTrain equals 'All Wheel Drive', then I want you to change the value to 'AWD'
- If the PowerTrain equals 'Rear Wheel Drive', then I want you to change the value to 'RWD'
- If the PowerTrain equals 'Front Wheel Drive', then I want you to change the value to 'FWD'

SELECT  PowerTrain, REPLACE(PowerTrain, 'Front Wheel Drive', 'FWD')
FROM evCars

SELECT  PowerTrain, REPLACE(PowerTrain, 'Rear Wheel Drive', 'RWD')
FROM evCars

SELECT  PowerTrain, REPLACE(PowerTrain, 'All Wheel Drive', 'AWD')
FROM evCars

UPDATE evCars

SET PowerTrain = REPLACE(PowerTrain, 'Rear Wheel Drive', 'RWD')

UPDATE evCars

SET PowerTrain = REPLACE(PowerTrain, 'Front Wheel Drive', 'FWD')

UPDATE evCars

SET PowerTrain = REPLACE(PowerTrain, 'All Wheel Drive', 'AWD')

select *
FROM evCars

## Section 7

SELECT "PriceEuro" FROM "evCars";

SELECT "PriceEuro" , ROUND(PriceEuro * 1.09, 2) as PriceEuro
FROM "evCars";

UPDATE evCars

SET PriceEuro = PriceEuro * 1.09

ALTER TABLE evCars

RENAME PriceEuro TO PriceUSD

select *
FROM evCars